const male = {
  А: [
    "Аввакум",
    "Аваз",
    "Агап",
    "Агафон",
    "Август",
    "Августин",
    "Аггей",
    "Авраам",
    "Абрам",
    "Аарон",
    "Автандил",
    "Авдей",
    "Авдей",
    "Азарий",
    "Арам",
    "Аркадий",
    "Арий",
    "Аристарх",
    "Арно",
    "Арон",
    "Арнольд",
    "Арсен, Арсений",
    "Архип",
    "Артур",
    "Артем",
    "Артемий",
    "Акакий",
    "Алан",
    "Ален",
    "Аким",
    "Альберт",
    "Альфред",
    "Александр",
    "Алексей",
    "Амвросий",
    "Анатолий",
    "Амадей",
    "Амадеус",
    "Амаяк",
    "Анисим",
    "Апполинарий",
    "Антон",
    "Ануфрий",
    "Ануфрий",
    "Андрей",
    "Аскольд",
    "Афанасий",
    "Ахмет",
    "Адам",
    "Адриан",
    "Адольф",
    "Ашот"
  ],
  Б: [
    "Бронислав",
    "Богдан",
    "Борис",
    "Борислав",
    "Болеслав",
    "Бонифаций",
    "Бернар",
    "Бенедикт"
  ],
  В: [
    "Варлаам",
    "Варфоломей",
    "Вальтер",
    "Валерий",
    "Валентин",
    "Василий",
    "Вадим",
    "Вацлав",
    "Владимир",
    "Владислав",
    "Владлен",
    "Виктор",
    "Вильгельм",
    "Вилен",
    "Викентий",
    "Виссарион",
    "Виталий",
    "Витольд",
    "Володар",
    "Вольдемар",
    "Всеволод",
    "Велизар",
    "Вениамин",
    "Венедикт",
    "Вячеслав"
  ],
  Г: [
    "Гавриил",
    "Гастон",
    "Градимир",
    "Григорий",
    "Глеб",
    "Горислав",
    "Гордон",
    "Гордей",
    "Густав",
    "Гевор",
    "Геральд",
    "Герасим",
    "Герман",
    "Георгий",
    "Генрих",
    "Геннадий"
  ],
  Д: [
    "Давид",
    "Дамир",
    "Даниил",
    "Динасий",
    "Дорофей",
    "Дмитрий",
    "Дональд",
    "Донат",
    "Денис",
    "Демид",
    "Демьян",
    "Джордан"
  ],
  Е: [
    "Евграф",
    "Евгений",
    "Егор",
    "Евстафий",
    "Евсей",
    "Евдоким",
    "Ермолай",
    "Ерофей",
    "Еремей",
    "Елизар",
    "Елисей",
    "Емельян",
    "Ефрем",
    "Ефим",
    "Ефимий"
  ],
  Ж: ["Жан", "Жорж", "Ждан"],
  З: ["Захар", "Захария", "Зигмунд", "Зиновий", "Зосима"],
  И: [
    "Иван",
    "Ибрагим",
    "Игнат",
    "Игнатий",
    "Игорь",
    "Израиль",
    "Измаил",
    "Изяслав",
    "Ираклий",
    "Иржи",
    "Иларион",
    "Илларион",
    "Илиан",
    "Ион",
    "Ипполит",
    "Иннокентий",
    "Ионос",
    "Ионас",
    "Иосиф",
    "Исаак",
    "Исаакий",
    "Исидор",
    "Иероним"
  ],
  К: [
    "Казимир",
    "Карл",
    "Карен",
    "Клавдий",
    "Кирилл",
    "Клим",
    "Климент",
    "Ким",
    "Клод",
    "Клемент",
    "Корнилий",
    "Корней",
    "Конрад",
    "Конкордий",
    "Константин",
    "Кондрат",
    "Ксаннф",
    "Кузьма"
  ],
  Л: [
    "Лаврентий",
    "Лазарь",
    "Лука",
    "Лукьян",
    "Лев",
    "Леван",
    "Леон",
    "Леонард",
    "Леонид",
    "Леопольд",
    "Леонтий",
    "Любомир",
    "Люсьен",
    "Людвиг"
  ],
  М: [
    "Марат",
    "Марк",
    "Мариан",
    "Мартин",
    "Мартын",
    "Май",
    "Макар",
    "Максим",
    "Максимилиан",
    "Мануил",
    "Матвей",
    "Мадлен",
    "Мирон",
    "Мирослав",
    "Милан",
    "Мисаил",
    "Михаил",
    "Митрофан",
    "Мичлов",
    "Моисей",
    "Модест",
    "Мстислав",
    "Мурат",
    "Муслим",
    "Мефодий",
    "Мечислав",
    "Мечеслав"
  ],
  Н: [
    "Назар",
    "Назарий",
    "Натан",
    "Наум",
    "Никанор",
    "Никита",
    "Никифор",
    "Николай",
    "Никон",
    "Нисон",
    "Нифонт",
    "Норман",
    "Нестор"
  ],
  О: ["Овидий", "Олан", "Олег", "Онисим", "Оскар", "Осип"],
  П: [
    "Павел",
    "Парамон",
    "Панкрат",
    "Памфил",
    "Прокофий",
    "Прохор",
    "Платон",
    "Пимен",
    "Порфирий",
    "Петр"
  ],
  Р: [
    "Равиль",
    "Раймонд",
    "Рафаил",
    "Рафик",
    "Ратмир",
    "Радий",
    "Радий",
    "Радомир",
    "Рашид",
    "Ринат",
    "Рихард",
    "Рифат",
    "Ричард",
    "Роберт",
    "Ролан",
    "Роман",
    "Ростислав",
    "Родион",
    "Рубен",
    "Руслан",
    "Рустам",
    "Рудольф",
    "Рем",
    "Ренольд"
  ],
  С: [
    "Савва",
    "Савел",
    "Савелий",
    "Самсон",
    "Самуил",
    "Святослав",
    "Спартак",
    "Сократ",
    "Соломон",
    "Стакрат",
    "Станимир",
    "Станислав",
    "Стивен",
    "Стоян",
    "Степан",
    "Севастьян",
    "Северин",
    "Серафим",
    "Сергей",
    "Семен"
  ],
  Т: [
    "Тарас",
    "Талик",
    "Таис",
    "Тамаз",
    "Трифон",
    "Трофим",
    "Тигран",
    "Тимон",
    "Тимофей",
    "Тимур",
    "Тит",
    "Тихон",
    "Терентий",
    "Тельман",
    "Теодор"
  ],
  У: ["Ульманас", "Устин"],
  Ф: [
    "Франц",
    "Фридрих",
    "Филипп",
    "Филимон",
    "Флорентий",
    "Фидель",
    "Фома",
    "Фердинанд",
    "Феликс",
    "Феодосий",
    "Федор",
    "Федот"
  ],
  Х: ["Харитон", "Христиан", "Христос", "Христофор"],
  Э: [
    "Эраст",
    "Эрик",
    "Эрнест",
    "Эльдар",
    "Эмиль",
    "Эммануил",
    "Эдвард",
    "Эдмунд",
    "Эдуард"
  ],
  Ю: ["Юрий", "Юлиан", "Юлий", "Юхим"],
  Я: ["Яромир", "Ярослав", "Яким", "Яков", "Ян", "Януарий", "Ясон"]
};

function rename(initOne, initTwo) {
  let namesList, fathersList;
  for (const n in male) {
    if (n === initOne) {
      namesList = male[n];
    }
    if (n === initTwo) {
      fathersList = male[n];
    }
  }
  const randNamePos = Math.floor(Math.random() * namesList.length);
  const randName = namesList[randNamePos];
  const randFatherPos = Math.floor(Math.random() * fathersList.length);
  let randFather = fathersList[randFatherPos];
  const fatherEnd = randFather.slice(randFather.length - 2, randFather.length);
  const fatherRoot = randFather.slice(0, randFather.length - 2);
  const genderEnd = "ич";
  switch (fatherEnd) {
    case "ий":
      randFather = fatherRoot + "ьев";
      break;
    case "ов":
      randFather = fatherRoot + "ов";
      break;
    case "ль":
      randFather = fatherRoot + "льев";
      break;
    case "ма":
      randFather = fatherRoot + "мов";
      break;
    case "ей":
      randFather = fatherRoot + "еев";
      break;
    case "ва":
      randFather = fatherRoot + "вов";
      break;
    case "ья":
      randFather = fatherRoot + "ь";
      break;
    case "ай":
      randFather = fatherRoot + "ев";
      break;
    case "ел":
      randFather = fatherRoot + "ельев";
      break;
    default:
      randFather += "ов";
      break;
  }
  return randName + " " + randFather + genderEnd;
}

function setNumberToLetter(data) {
  let i = 0;
  let letA = "";
  let letB = "";
  const items = Object.values(data).length;
  const a = Math.floor(Math.random() * items);
  const b = Math.floor(Math.random() * items);
  for (const n in data) {
    if (i === a) letA = n;
    i++;
  }
  i = 0;
  for (const n in data) {
    if (i === b) letB = n;
    i++;
  }
  return { letA, letB };
}

function renderNames() {
  const result = setNumberToLetter(male);
  return rename(result.letA, result.letB);
}

module.exports = () => {
  const data = { users: [] };
  for (let i = 0; i < 100; i++) {
    data.users.push({
      id: i,
      name: `${renderNames()}`,
      items: { id: i, name: `${renderNames()}` }
    });
  }
  return data;
};
